{
    "data": [
      {
        "nama": "Takbiratul Ihram",
        "detail": "Takbiratul ihram, yaitu membaca Allâhu Akbar saat memulai salat. Dengan takbiratul ihram, berarti umat Islam sudah benar-benar masuk dalam salat. Cara melakukan takbiratul ihram adalah dengan mengangkat dua tangan sejajar dengan telinga dan mengucapkan, “Allâhu Akbar",
        "gambar": "https://cdn-cas.orami.co.id/parenting/images/1600271048.width-1000.jpg"
      },
      {
        "nama": "Berdiri (Sedekap)",
        "detail": "Usai mengucapkan takbir pertama, maka lipat tangan di dada, tepatnya pada area yang mendekati hati. Selanjutnya, membaca doa iftitah berikut ini: ",
        "gambar": "https://cdn-cas.orami.co.id/parenting/images/Sholat_Jenazah_-1.width-1000.jpg"
      },
      {
        "nama": "Rukuk",
        "detail": "Ketika rukuk harus sambil membaca: سُبْحَانَ رَبِّىَ الْعَظِيمِ وَبِحَمْدِهِ 'Subhâna rabbiyal adhîmi wa bihamdihi'",
        "gambar": "https://cdn-cas.orami.co.id/parenting/images/sholat.width-1000.jpg"
      },
      {
        "nama": "I'tidal",
        "detail": "Usai rukuk, maka dilanjutkan dengan membaca: سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ “Sami alloohu liman hamidah“. Setelah itu, dilanjutkan membaca itidal: رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَوَاتِ وَالأَرْضِ وَمِلْءَ مَا شِئْتَ مِنْ شَىْءٍ بَعْدُ 'Robbanaa lakal hamdu mil’as samaawaati wal ardli wa mil-a maa syi’ta min syai’in ba’du'",
        "gambar": "https://images.unsplash.com/photo-1668403783987-5f5054c71c70?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=435&q=80"
      },
      {
        "nama": "Sujud",
        "detail": "Setelah itidal, yakni sujud. Sujud adalah posisi yang dilakukan dengan meletakkan kedua telapak tangan dan menempelkan dahi serta hidung pada sejadah. Ketika sujud, bacaannya ialah: سُبْحَانَ رَبِّىَ الْأَعْلَى“Subhâna rabbiyal a’la wa bihamdihi,”",
        "gambar": "https://images.unsplash.com/photo-1668403783987-5f5054c71c70?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=435&q=80"
      },
      {
        "nama": "Duduk Diantara Dua Sujud",
        "detail": "Setelah itidal, yakni sujud. Sujud adalah posisi yang dilakukan dengan meletakkan kedua telapak tangan dan menempelkan dahi serta hidung pada sejadah. Ketika sujud, bacaannya ialah: سُبْحَانَ رَبِّىَ الْأَعْلَى“Subhâna rabbiyal a’la wa bihamdihi,”",
        "gambar": "https://images.unsplash.com/photo-1668403783987-5f5054c71c70?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=435&q=80"
      },
      {
        "nama": "Tahiyat Awal",
        "detail": "Gerakan salat tasyahud awal dilakukan saat rakaat kedua pada salat Dzuhur, Ashar, Magrib dan Isya'. Inilah bacaannya: لتَّحِيَّاتُ الْمُبَارَكَاتُ الصَّلَوَاتُ الطَّيِّبَاتُ لِلَّهِ السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِىُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ'Attahiyyatul mubarakaatus salawatut tayyibatu lillah. Assalamu alaika ayyuhan nabiyyu warahmatullahi wabarakatuh. Assalamu alaina wa ala ibadillahis salihin. Asyhadu alla ilaha illallah. Wa asyhadu anna Muhammadar rasulullah.",
        "gambar": "https://cdn-cas.orami.co.id/parenting/images/Duduk-iftirasy.width-1000.jpg"
      },
      {
        "nama": "Tahiyat Akhir",
        "detail": "Sebelum mengucapkan salam, harus melakukan tasyahud akhir dengan membaca: اَللَّهُمَّ صَلِّ عَلىَ مُحَمَّدٍ وَعَلىَ آلِ مُحَمَّدٍ كَماَ صَلَّيْتَ عَلىَ إِبْرَاهِيْمَ وَعَلىَ آلِ إِبْرَاهِيْمَ إِنـَّكَ حَمِيْدٌ مَجِيْدٌ اَللَّهُمَّ باَرِكْ عَلىَ مُحَمَّدٍ وَعَلىَ آلِ مُحَمَّدٍ كَماَ باَرَكْتَ عَلىَ إِبْرَاهِيْمَ وَعَلىَ آلِ إِبْرَاهِيْمَ إِنـَّكَ حَمِيْدٌ مَجِيْدٌ 'Alloohumma sholli ‘alaa Muhammad wa ‘alaa aali Muhammad kamaa shollaita ‘alaa Ibroohim wa ‘alaa aali Ibroohimm innaka hamiidum majiid. Alloohumma baarik ‘alaa Muhammad wa ‘alaa aali Muhammad kamaa baarokta ‘alaa Ibroohim wa ‘alaa aali Ibroohimm innaka hamiidum majiid.'",
        "gambar": "https://images.unsplash.com/photo-1668403783987-5f5054c71c70?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=435&q=80"
      },
      {
        "nama": "Salam",
        "detail": "Tata cara salat yang terakhir adalah mengucapkan salam dengan menoleh ke kanan dan ke kiri. السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ 'Assalamu ‘alaikum warahmatullah'",
        "gambar": "https://images.unsplash.com/photo-1668403783987-5f5054c71c70?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=435&q=80"
      }
    ]
  }